src/mcmc-subsidiary.org
#+TITLE: Advanced Machine Learning Subsidary Notes
#+SUBTITLE: Lecture 25: MCMC

* Keywords
  * Monte Carlo methods, MCMC, Variational Methods

* Main Points

** Monte Carlo
   - Except in a few cases Bayesian inference is hard
     + It is easy when we have a conjugate prior giving us a simple posterior
     + But, when we want to model complicated situations our
       likelihood function usually doesn't have a conjugate prior
     + This means the posterior is not expressible as a simple
       probability distribution
     + Furthermore it is usually impossible to compute the marginal
       likelihood or evidence
       $$ \Prob{\mathcal{D}} = \sum_{\bm{\Theta}}
       \Prob{\bm{\Theta}|\mathcal{D}} \, \Prob{\bm{\Theta}} $$
     + The sum or integral over variables $\bm{\Theta}$ is often too
       large to make this the feasible
     + You could try to obtain a histogram for the posterior, but if
       $\bm{\Theta}$ has many components the curse of dimensionality
       makes this difficult
   - There is a simple answer which is to obtain samples from the posterior
     + We can use this to estimate expectations of any function,
       $g(\bm{\Theta})$, of $\bm{\Theta}$
       $$ \av[\bm{\Theta}|\mathcal{D}]{g(\bm{\Theta})} \approx
       \frac{1}{n} \sum_{i=1}^{n}   g(\bm{\Theta}_{i}) $$
       * $\bm{\Theta}_{i}$ are random deviates drawn from
         the posterior $\Prob{\bm{\Theta}_{i}|\mathcal{D}}$
       * (random deviates or random variates are values drawn from a
         probability distibution)
       * When the posterior distribution is well behaved (doesn't have a
	 thick tail) then the error in the approximation fall off as $1/\sqrt{n}$
   - The problem is you have to be able to sample random deviates
     from $P(\mathcal{D}|\bm{\Theta})\,f(\bm{\Theta})$
   - For simple distributions there are two classic solutions to
     generating random deviates
     1. /Transformation Methods/
	+ If we can compute the cumulative probability function
          $$ F_{X}(x) = \int_{-\infty}^{x} f(t)\,\dd t $$
          and invert $F_{X}(x)$, then $X=F^{-1}_{X}(U)$ will be a
          random deviate with density $f$, where $U$
          is a uniform standard deviate between 0 and 1
	+ This only works for a few classic distributions
     2. /Rejection Method/
	+ In the rejection methods we find another distribution
          $g_{Y}(y)$ that we can sample from that satisfies
	  $$ c\, g_{Y}(x) > f_{X}(x) $$
	+ Then we generate a deviate $Y\sim g_{Y}$ and accept it with
          a probability $f_{X}(Y)/(c\,g_{Y}(Y))$
	+ The expected rejection rate is $c-1$
	+ This is a more general method, but is efficient only if we
          have a good approximating function $g_{Y}(y)$ (good in the
          sense that $c$ is not too large)
	+ Particularly for multivariate (i.e. high dimensional) random
          variables it is often very hard to find a good approximating
          function

