src/figures/mcmc-subsidiary.tex
% Created 2021-01-28 Thu 17:27
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[a4paper,margin=20mm]{geometry}
\usepackage{amsmath}
\usepackage{amsfonts}
\usepackage{stmaryrd}
\usepackage{bm}
\usepackage{minted}
\usemintedstyle{emacs}
\usepackage[T1]{fontenc}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\newcommand{\tr}{\textsf{T}}
\newcommand{\grad}{\bm{\nabla}}
\newcommand{\av}[2][]{\mathbb{E}_{#1\!}\left[ #2 \right]}
\newcommand{\Prob}[2][]{\mathbb{P}_{#1\!}\left[ #2 \right]}
\newcommand{\logg}[1]{\log\!\left( #1 \right)}
\newcommand{\pred}[1]{\left\llbracket { \small #1} \right\rrbracket}
\newcommand{\e}[1]{{\rm e}^{#1}}
\newcommand{\dd}{\mathrm{d}}
\DeclareMathAlphabet{\mat}{OT1}{cmss}{bx}{n}
\newcommand{\normal}[2]{\mathcal{N}\!\left(#1 \big| #2 \right)}
\newcounter{eqCounter}
\setcounter{eqCounter}{0}
\newcommand{\explanation}{\setcounter{eqCounter}{0}\renewcommand{\labelenumi}{(\arabic{enumi})}}
\newcommand{\eq}[1][=]{\stepcounter{eqCounter}\stackrel{\text{\tiny(\arabic{eqCounter})}}{#1}}
\newcommand{\argmax}{\mathop{\mathrm{argmax}}}
\newcommand{\Dist}[2][Binom]{\mathrm{#1}\left( \strut {#2} \right)}
\author{Adam Prügel-Bennett}
\date{\today}
\title{Advanced Machine Learning Subsidary Notes\\\medskip
\large Lecture 20: MCMC}
\hypersetup{
 pdfauthor={Adam Prügel-Bennett},
 pdftitle={Advanced Machine Learning Subsidary Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Keywords}
\label{sec:orgd660a44}
\begin{itemize}
\item Monte Carlo methods, MCMC, Variational Methods
\end{itemize}

\section{Main Points}
\label{sec:orga9dd7d2}

\subsection{Monte Carlo}
\label{sec:org74a24eb}
\begin{itemize}
\item Except in a few cases Bayesian inference is hard
\begin{itemize}
\item It is easy when we have a conjugate prior giving us a simple posterior
\item But, when we want to model complicated situations our
likelihood function usually doesn't have a conjugate prior
\item This means the posterior is not expressible as a simple
probability distribution
\item Furthermore it is usually impossible to compute the marginal
likelihood or evidence
$$ \Prob{\mathcal{D}} = \sum_{\bm{\Theta}}
       \Prob{\bm{\Theta}|\mathcal{D}} \, \Prob{\bm{\Theta}} $$
\item The sum or integral over variables \(\bm{\Theta}\) is often too
large to make this the feasible
\item You could try to obtain a histogram for the posterior, but if
\(\bm{\Theta}\) has many components the curse of dimensionality
makes this difficult
\end{itemize}
\item There is a simple answer which is to obtain samples from the posterior
\begin{itemize}
\item We can use this to estimate expectations of any function,
\(g(\bm{\Theta})\), of \(\bm{\Theta}\)
$$ \av[\bm{\Theta}|\mathcal{D}]{g(\bm{\Theta})} \approx
       \frac{1}{n} \sum_{i=1}^{n}   g(\bm{\Theta}_{i}) $$
\begin{itemize}
\item \(\bm{\Theta}_{i}\) are random deviates drawn from
the posterior \(\Prob{\bm{\Theta}_{i}|\mathcal{D}}\)
\item (random deviates or random variates are values drawn from a
probability distibution)
\item When the posterior distribution is well behaved (doesn't have a
thick tail) then the error in the approximation fall off as \(1/\sqrt{n}\)
\end{itemize}
\end{itemize}
\item The problem is you have to be able to sample random deviates
from \(P(\mathcal{D}|\bm{\Theta})\,f(\bm{\Theta})\)
\item For simple distributions there are two classic solutions to
generating random deviates
\begin{enumerate}
\item \emph{Transformation Methods}
\begin{itemize}
\item If we can compute the cumulative probability function
$$ F_{X}(x) = \int_{-\infty}^{x} f(t)\,\dd t $$
and invert \(F_{X}(x)\), then \(X=F^{-1}_{X}(U)\) will be a
random deviate with density \(f\), where \(U\)
is a uniform standard deviate between 0 and 1
\item This only works for a few classic distributions
\end{itemize}
\item \emph{Rejection Method}
\begin{itemize}
\item In the rejection methods we find another distribution
\(g_{Y}(y)\) that we can sample from that satisfies
$$ c\, g_{Y}(x) > f_{X}(x) $$
\item Then we generate a deviate \(Y\sim g_{Y}\) and accept it with
a probability \(f_{X}(Y)/(c\,g_{Y}(Y))\)
\item The expected rejection rate is \(c-1\)
\item This is a more general method, but is efficient only if we
have a good approximating function \(g_{Y}(y)\) (good in the
sense that \(c\) is not too large)
\item Particularly for multivariate (i.e. high dimensional) random
variables it is often very hard to find a good approximating
function
\end{itemize}
\end{enumerate}
\end{itemize}
