src/mcmc-subsidiary.org
** Markov-Chain Monte Carlo (MCMC)
   - Fortunately there is another method for generating random
     deviates which is very general
   - This uses a Markov-Chain where we update an initial state of our system
   - If we choose the dynamics correctly eventually we will reach a
     state that is correctly distributed
   - Suppose we have a set of states, $\mathcal{S}$, and we want to choose a random
     sample from a distribution $\bm{\pi} = (\pi_{i}|i\in\mathcal{S}})$
     + $\pi_{i}$ is the probability of being in state \(i\)---we get to
       choose this (for Bayesian inference we will want to choose the
       posterior probability)
   - Let $M_{ij}$ be the transition probability from state $j$ to
     state $i$
     + $\sum_{i} M_{ij} =1$ (if we start any state, $j$ say, we have
       to end up in another state)
     + $M_{ij}\geq0$ (it is a probability)
     + Matrices of non-negative elements whose rows sum to one are
       known as *stochastic matrices*
   - If we choose $M_{ij}$ so that
     $$ M_{ij} \, \pi_{j} = M_{ji} \, \pi_{i} $$
     + then after some time the probability of being in state $i$ will
       be $\pi_{i}$ (there are some mild conditions on $\mat{M}$ for
       this to be true)
     + This condition is known as *detailed balance*
     + Note that if we sum the detailed balance equation then
       $$ \sum_{j\in\mathcal{S}} M_{ij} \, \pi_{j} =
       \sum_{j\in\mathcal{S}} M_{ji} \, \pi_{i}  = \pi_{j}
       \label{eq:stochastic} $$
       * since $\sum_{j} M_{ji} = 1$
     + Writing this in matrix form
       $$ \mat{M} \bm{\pi} = \bm{\pi} $$
       * That is, $\bm{\pi}$ is an eigenvalue of $\mat{M}$ with
         eigenvalue 1
     + Because $\mat{M}$ is a stochastic matrix all eigenvalues will
       be less than or equal to 1
       * To prove this let $\bm{v}$ be an eigenvector of $\mat{M}$
         with eigenvalue $\lambda$
	 $$  \sum_{j\in\mathcal{S}} M_{ij} \, v_{j} = \lambda \, v_{i} $$
	 taking the absolute value of both sides
	 $$ \biggl| \sum_{j\in\mathcal{S}} M_{ij} \, v_{j} \biggr|
         = |\lambda\, v_{i}| = |\lambda| \, |v_{i}| $$
       * But
	 $$ \biggl| \sum_{j\in\mathcal{S}} M_{ij} \, v_{j} \biggr|
	 \leq \sum_{j\in\mathcal{S}}\left| M_{ij} \, v_{j} \right|
	 = \sum_{j\in\mathcal{S}} M_{ij} \, |v_{j}| $$
	 where we have used $M_{ij}\geq0$ (and essentially $|a + b| \leq |a| + |b|$)
       * Thus
	 $$ \sum_{j\in\mathcal{S}} M_{ij} \, |v_{j}|  \geq |\lambda|
         \, |v_{i}| $$
       * Summing both sides with respect to $i$
	 \begin{align*}
	 \sum_{i\in\mathcal{S}} \sum_{j\in\mathcal{S}}
         M_{ij}\, |v_{j}|  &\geq |\lambda| \,
         \sum_{i\in\mathcal{S}} |v_{i}|  \\
	 \sum_{j\in\mathcal{S}} \sum_{i\in\mathcal{S}}
         M_{ij}\, |v_{j}|  &\geq |\lambda| \,
         \sum_{i\in\mathcal{S}} |v_{i}|  \\
	 \sum_{j\in\mathcal{S}}  |v_{j}| &\geq |\lambda| \,
         \sum_{i\in\mathcal{S}} |v_{i}| 
         \end{align*}
         where we used $\sum_{i\in\mathcal{S}}M_{ij} = 1$
       * It follows that $\lambda\leq 1$
       * Let $\bm{p}(t)$ be a vector whose elements $p_{i}(t)$
         equal the probability of being in state $i$ at time $t$
       * If the set of eigenvectors span the whole space, then any
         starting vector $\bm{p}(0)$ can be written in terms of the
         eigenvectors 
	 $$ \bm{p}(0) = \sum_{i} c_{i}\,\bm{v}_{i} $$
	 (this is just a change of basis)
       * The probability vector after one step is given by
	 $$ \bm{p}(1) = \mat{M} \, \bm{p}(0) = \mat{M} \sum_{i} c_{i}\,\bm{v}_{i} 
	 =  \sum_{i} c_{i}\,\mat{M}\,\bm{v}_{i} 
         =  \sum_{i} c_{i}\,\lambda_{i}\,\bm{v}_{i} $$
       * After $t$ steps
	 $$ \bm{p}(t) = \mat{M}^{t} \, \bm{x} = \sum_{i}
         c_{i}\,\lambda_{i}^{t}\,\bm{v}_{i} $$
       * If $|\lambda|<1$ will then $\lambda_{i}^{t}$ will shrink
         exponentially fast so that
	 $$ \lim_{t\rightarrow\infty} \bm{p}(t) =
         \sum_{i:\lambda_{i}=0} c_{i} \bm{v}_{i} $$
       * That is we converge onto the set of eigenvectors with
         eigenvalue 1
       * But if detailed balance is conserved then $\bm{\pi}$
         satisfies this
       * There are some conditioned to ensure that there is only one
         such eigenvector with eigenvalue 1
	 - We have to ensure that we can get from any state to any
           other through some series of transitions
	 - We have to prevent periodic behaviour (e.g. if our set of
           states where from 1 to n and we could only move from state
           $i$ to state $i-1$ or $i+1$ then if we started on an odd
           state we would always be on an odd state after an even
           number of moves)
	 - It is very easy to insure both conditions
   - Now the problem is to choose the transition probabilities to
     satisfy detailed balance
   - This is easy and can be done in different ways
   - *Metropolis Algorithm*
     + A very easy way to achieve detailed balance is that starting
       from state $i$ we choose a neighbouring state $j$
       * We have to make sure the probability of choosing state $i$
         when in state $j$ is the same as the probability of choosing
         state $j$ when starting in state $i$
     + We now move to state $j$ if
       * $\pi_{j} \geq \pi_{i}$
       * or we move anyway with a probability $\pi_{i}/\pi_{j}$
     + It is a simple exercise to show that this satisfies detailed balance
   - *Metropolis-Hastings Algorithm*
     + Sometimes it is difficult to insure that choosing state $i$
       form state $j$ is the same as choosing state $j$ from state $i$
       * As an example considering our states were non-negative
         integers, we move from state $i$ to state $i-1$ and $i+1$
         with probability $\tfrac{1}{2}$, but we have a problem at
         state 0 where we can't move to state $i-1$
     + We can modify the Metropolis algorithm.  Suppose $p(i|j)$ is
       the probability of choosing state $i$ starting is state $j$
       then let $r = p(j|i) \, \pi_{i}/ (p(i|j)\,\pi_{j})$
       * we accept the move if $r>1$
       * or with a probability $r$
       * in practice we can just just draw a random number $U$
         uniformly between 0 and 1 and accept the move if $U<r$
       * this is the same as the Metropolis algorithm if $p(j|i) = p(i|j)$
   - We can equally well apply this to (multi-dimensional) continuous
     variables, $\bm{\theta}$
     + If $\bm{\theta}$ is our current set of parameters, we choose a
       new set of parameter $\bm{\theta}'$ with probability
       $p(\bm{\theta}'|\bm{\theta})$ and then accept this proposal if
       $r = (p(\bm{\theta}|\bm{\theta}') \, \pi(\bm{\theta}'))/
       (p(\bm{\theta}'|\bm{\theta}) \, \pi(\bm{\theta})) \geq 0$ or
       with a probability $r$
     + We now choose $p(\bm{\theta}'|\bm{\theta})$ so that with high
       probability $\bm{\theta}'$ is close to $\bm{\theta}$, this
       ensures that there is a reasonable high acceptance rate
   - For Bayes calculations then $\pi(\bm{\theta})$ would be our
     posterior $f(\bm{\theta}|\mathcal{D})$
     + MCMC has the nice property that the update depends only on the
       ratio
       $$ \frac{\pi(\bm{\theta}')}{ \pi(\bm{\theta})} =
       \frac{f(\bm{\theta}'|\mathcal{D})}{f(\bm{\theta}|\mathcal{D})} 
       =
       \frac{f(\mathcal{D}|\bm{\theta}')\,f(\mathcal{D}|\bm{\theta}')}
       {f(\mathcal{D}|\bm{\theta})\,f(\mathcal{D}|\bm{\theta})} $$
     + That is, the normalising factor $f(\mathcal{D})$ that appears
       in Bayes' rule cancels
     + This is important because this is usually incomputable
       (although we can use MCMC to estimate this)
     + There is also often another advantage of this ratio: if
       we only change one variable at a time then frequently we can
       compute the ratio much more efficiently than the full
       likelihood and priors
     + When this happens then it pays to choose a single variable, $\theta_{i}$, at a
       time, chose a neighbour $\theta'_{i}$ from a distribution
       $p(\theta'_{i}|\theta_{i})$ and decide whether to accept this update
     + This one-variable-at-a-time procedure goes by the name of
       /Gibbs' sampling/
   - *Convergence*
     + A problem with MCMC is that your initial parameter, $\bm{p}(0)$,
       is different from $\bm{\pi}$ so you have to wait
       some considerable time before your samples are from posterior distribution
     + As we saw earlier the convergence rate is determined by the
       second largest eigenvalue of the transition matrix $\mat{M}$
       (we never explicit calculate $\mat{M}$ so we don't know what
       this eigenvalue is)
       * If it is very close to 1 then your convergence can be slow
     + Furthermore if you posterior distribution is broad you need
       lots of independent sample to accurately compute expectations
     + To obtain an independent sample we have to run our MCMC a long time
     + In practice you have to throw away some samples in a /burn-in/ period
     + You can then average over all the remaining samples you have (including
       repetitions where you don't accept a move)
     + If you do this long enough then you should get samples that
       cover values of $\bm{\theta}$ with a high posterior probability
     + MCMC is slow because of this
     + There are a lot of clever tricks to speed up convergence and
       decorrelation times
   - Often MCMC seems daunting because of the apparent difficulties
     + But don't be put off
     + You only need to use the tricks for extremely complicated problems
     + Usually a simple implementation works fine
     + Modern computers are so fast that convergence isn't usually a problem
       * Convergence can be a problem in pathological cases---these
         occur when using MCMC to model some physical systems---but
         for many Bayesian problems the Markov Chain is /rapidly
         mixing/ meaning the convergence time is not excessively long

