src/figures/mcmc-subsidiary.tex

\subsection{Markov-Chain Monte Carlo (MCMC)}
\label{sec:org0b746ce}
\begin{itemize}
\item Fortunately there is another method for generating random
deviates which is very general
\item This uses a Markov-Chain where we update an initial state of our system
\item If we choose the dynamics correctly eventually we will reach a
state that is correctly distributed
\item Suppose we have a set of states, \(\mathcal{S}\), and we want to choose a random
sample from a distribution \(\bm{\pi} = (\pi_{i}|i\in\mathcal{S}})\)
\begin{itemize}
\item \(\pi_{i}\) is the probability of being in state \(i\)---we get to
choose this (for Bayesian inference we will want to choose the
posterior probability)
\end{itemize}
\item Let \(M_{ij}\) be the transition probability from state \(j\) to
state \(i\)
\begin{itemize}
\item \(\sum_{i} M_{ij} =1\) (if we start any state, \(j\) say, we have
to end up in another state)
\item \(M_{ij}\geq0\) (it is a probability)
\item Matrices of non-negative elements whose rows sum to one are
known as \textbf{stochastic matrices}
\end{itemize}
\item If we choose \(M_{ij}\) so that
$$ M_{ij} \, \pi_{j} = M_{ji} \, \pi_{i} $$
\begin{itemize}
\item then after some time the probability of being in state \(i\) will
be \(\pi_{i}\) (there are some mild conditions on \(\mat{M}\) for
this to be true)
\item This condition is known as \textbf{detailed balance}
\item Note that if we sum the detailed balance equation then
$$ \sum_{j\in\mathcal{S}} M_{ij} \, \pi_{j} =
       \sum_{j\in\mathcal{S}} M_{ji} \, \pi_{i}  = \pi_{j}
       \label{eq:stochastic} $$
\begin{itemize}
\item since \(\sum_{j} M_{ji} = 1\)
\end{itemize}
\item Writing this in matrix form
$$ \mat{M} \bm{\pi} = \bm{\pi} $$
\begin{itemize}
\item That is, \(\bm{\pi}\) is an eigenvalue of \(\mat{M}\) with
eigenvalue 1
\end{itemize}
\item Because \(\mat{M}\) is a stochastic matrix all eigenvalues will
be less than or equal to 1
\begin{itemize}
\item To prove this let \(\bm{v}\) be an eigenvector of \(\mat{M}\)
with eigenvalue \(\lambda\)
$$  \sum_{j\in\mathcal{S}} M_{ij} \, v_{j} = \lambda \, v_{i} $$
taking the absolute value of both sides
$$ \biggl| \sum_{j\in\mathcal{S}} M_{ij} \, v_{j} \biggr|
         = |\lambda\, v_{i}| = |\lambda| \, |v_{i}| $$
\item But
$$ \biggl| \sum_{j\in\mathcal{S}} M_{ij} \, v_{j} \biggr|
	 \leq \sum_{j\in\mathcal{S}}\left| M_{ij} \, v_{j} \right|
	 = \sum_{j\in\mathcal{S}} M_{ij} \, |v_{j}| $$
where we have used \(M_{ij}\geq0\) (and essentially \(|a + b| \leq |a| + |b|\))
\item Thus
$$ \sum_{j\in\mathcal{S}} M_{ij} \, |v_{j}|  \geq |\lambda|
         \, |v_{i}| $$
\item Summing both sides with respect to \(i\)
\begin{align*}
\sum_{i\in\mathcal{S}} \sum_{j\in\mathcal{S}}
M_{ij}\, |v_{j}|  &\geq |\lambda| \,
\sum_{i\in\mathcal{S}} |v_{i}|  \\
\sum_{j\in\mathcal{S}} \sum_{i\in\mathcal{S}}
M_{ij}\, |v_{j}|  &\geq |\lambda| \,
\sum_{i\in\mathcal{S}} |v_{i}|  \\
\sum_{j\in\mathcal{S}}  |v_{j}| &\geq |\lambda| \,
\sum_{i\in\mathcal{S}} |v_{i}| 
\end{align*}
where we used \(\sum_{i\in\mathcal{S}}M_{ij} = 1\)
\item It follows that \(\lambda\leq 1\)
\item Let \(\bm{p}(t)\) be a vector whose elements \(p_{i}(t)\)
equal the probability of being in state \(i\) at time \(t\)
\item If the set of eigenvectors span the whole space, then any
starting vector \(\bm{p}(0)\) can be written in terms of the
eigenvectors 
$$ \bm{p}(0) = \sum_{i} c_{i}\,\bm{v}_{i} $$
(this is just a change of basis)
\item The probability vector after one step is given by
$$ \bm{p}(1) = \mat{M} \, \bm{p}(0) = \mat{M} \sum_{i} c_{i}\,\bm{v}_{i} 
	 =  \sum_{i} c_{i}\,\mat{M}\,\bm{v}_{i} 
         =  \sum_{i} c_{i}\,\lambda_{i}\,\bm{v}_{i} $$
\item After \(t\) steps
$$ \bm{p}(t) = \mat{M}^{t} \, \bm{x} = \sum_{i}
         c_{i}\,\lambda_{i}^{t}\,\bm{v}_{i} $$
\item If \(|\lambda|<1\) will then \(\lambda_{i}^{t}\) will shrink
exponentially fast so that
$$ \lim_{t\rightarrow\infty} \bm{p}(t) =
         \sum_{i:\lambda_{i}=0} c_{i} \bm{v}_{i} $$
\item That is we converge onto the set of eigenvectors with
eigenvalue 1
\item But if detailed balance is conserved then \(\bm{\pi}\)
satisfies this
\item There are some conditioned to ensure that there is only one
such eigenvector with eigenvalue 1
\begin{itemize}
\item We have to ensure that we can get from any state to any
other through some series of transitions
\item We have to prevent periodic behaviour (e.g. if our set of
states where from 1 to n and we could only move from state
\(i\) to state \(i-1\) or \(i+1\) then if we started on an odd
state we would always be on an odd state after an even
number of moves)
\item It is very easy to insure both conditions
\end{itemize}
\end{itemize}
\end{itemize}
\item Now the problem is to choose the transition probabilities to
satisfy detailed balance
\item This is easy and can be done in different ways
\item \textbf{Metropolis Algorithm}
\begin{itemize}
\item A very easy way to achieve detailed balance is that starting
from state \(i\) we choose a neighbouring state \(j\)
\begin{itemize}
\item We have to make sure the probability of choosing state \(i\)
when in state \(j\) is the same as the probability of choosing
state \(j\) when starting in state \(i\)
\end{itemize}
\item We now move to state \(j\) if
\begin{itemize}
\item \(\pi_{j} \geq \pi_{i}\)
\item or we move anyway with a probability \(\pi_{i}/\pi_{j}\)
\end{itemize}
\item It is a simple exercise to show that this satisfies detailed balance
\end{itemize}
\item \textbf{Metropolis-Hastings Algorithm}
\begin{itemize}
\item Sometimes it is difficult to insure that choosing state \(i\)
form state \(j\) is the same as choosing state \(j\) from state \(i\)
\begin{itemize}
\item As an example considering our states were non-negative
integers, we move from state \(i\) to state \(i-1\) and \(i+1\)
with probability \(\tfrac{1}{2}\), but we have a problem at
state 0 where we can't move to state \(i-1\)
\end{itemize}
\item We can modify the Metropolis algorithm.  Suppose \(p(i|j)\) is
the probability of choosing state \(i\) starting is state \(j\)
then let \(r = p(j|i) \, \pi_{i}/ (p(i|j)\,\pi_{j})\)
\begin{itemize}
\item we accept the move if \(r>1\)
\item or with a probability \(r\)
\item in practice we can just just draw a random number \(U\)
uniformly between 0 and 1 and accept the move if \(U<r\)
\item this is the same as the Metropolis algorithm if \(p(j|i) = p(i|j)\)
\end{itemize}
\end{itemize}
\item We can equally well apply this to (multi-dimensional) continuous
variables, \(\bm{\theta}\)
\begin{itemize}
\item If \(\bm{\theta}\) is our current set of parameters, we choose a
new set of parameter \(\bm{\theta}'\) with probability
\(p(\bm{\theta}'|\bm{\theta})\) and then accept this proposal if
\(r = (p(\bm{\theta}|\bm{\theta}') \, \pi(\bm{\theta}'))/
       (p(\bm{\theta}'|\bm{\theta}) \, \pi(\bm{\theta})) \geq 0\) or
with a probability \(r\)
\item We now choose \(p(\bm{\theta}'|\bm{\theta})\) so that with high
probability \(\bm{\theta}'\) is close to \(\bm{\theta}\), this
ensures that there is a reasonable high acceptance rate
\end{itemize}
\item For Bayes calculations then \(\pi(\bm{\theta})\) would be our
posterior \(f(\bm{\theta}|\mathcal{D})\)
\begin{itemize}
\item MCMC has the nice property that the update depends only on the
ratio
$$ \frac{\pi(\bm{\theta}')}{ \pi(\bm{\theta})} =
       \frac{f(\bm{\theta}'|\mathcal{D})}{f(\bm{\theta}|\mathcal{D})} 
       =
       \frac{f(\mathcal{D}|\bm{\theta}')\,f(\mathcal{D}|\bm{\theta}')}
       {f(\mathcal{D}|\bm{\theta})\,f(\mathcal{D}|\bm{\theta})} $$
\item That is, the normalising factor \(f(\mathcal{D})\) that appears
in Bayes' rule cancels
\item This is important because this is usually incomputable
(although we can use MCMC to estimate this)
\item There is also often another advantage of this ratio: if
we only change one variable at a time then frequently we can
compute the ratio much more efficiently than the full
likelihood and priors
\item When this happens then it pays to choose a single variable, \(\theta_{i}\), at a
time, chose a neighbour \(\theta'_{i}\) from a distribution
\(p(\theta'_{i}|\theta_{i})\) and decide whether to accept this update
\item This one-variable-at-a-time procedure goes by the name of
\emph{Gibbs' sampling}
\end{itemize}
\item \textbf{Convergence}
\begin{itemize}
\item A problem with MCMC is that your initial parameter, \(\bm{p}(0)\),
is different from \(\bm{\pi}\) so you have to wait
some considerable time before your samples are from posterior distribution
\item As we saw earlier the convergence rate is determined by the
second largest eigenvalue of the transition matrix \(\mat{M}\)
(we never explicit calculate \(\mat{M}\) so we don't know what
this eigenvalue is)
\begin{itemize}
\item If it is very close to 1 then your convergence can be slow
\end{itemize}
\item Furthermore if you posterior distribution is broad you need
lots of independent sample to accurately compute expectations
\item To obtain an independent sample we have to run our MCMC a long time
\item In practice you have to throw away some samples in a \emph{burn-in} period
\item You can then average over all the remaining samples you have (including
repetitions where you don't accept a move)
\item If you do this long enough then you should get samples that
cover values of \(\bm{\theta}\) with a high posterior probability
\item MCMC is slow because of this
\item There are a lot of clever tricks to speed up convergence and
decorrelation times
\end{itemize}
\item Often MCMC seems daunting because of the apparent difficulties
\begin{itemize}
\item But don't be put off
\item You only need to use the tricks for extremely complicated problems
\item Usually a simple implementation works fine
\item Modern computers are so fast that convergence isn't usually a problem
\begin{itemize}
\item Convergence can be a problem in pathological cases---these
occur when using MCMC to model some physical systems---but
for many Bayesian problems the Markov Chain is \emph{rapidly
mixing} meaning the convergence time is not excessively long
\end{itemize}
\end{itemize}
\end{itemize}
