src/mcmc-subsidiary.org
** Variational Techniques
   - This is a completely different approach to MCMC, but it tries to
     solve the same problem, but uses a different strategy
   - This is again technically challenging and I don't expect you to
     memorise the derivation
   - We saw in earlier lectures that we can cheat by seeking the parameters that maximise
     the posterior (the, so called, MAP solution)
   - But this sacrifices all the probabilistic information
   - In variational techniques we try to approximate the posterior
     with a simpler distribution
   - That is, we approximate the prior $f(\bm{\theta}|\mathcal{D})$
     with a simpler distribution $q(\bm{\theta}|\bm{w})$ where we get
     choose $\bm{w}$ to make $q$ close to $f$
   - Usually we choose $q$ to be a factorisable distribution
     $$ q(\bm{\theta}|\bm{w}) = \prod_{i} q(\theta_{i}|w_{i}) $$
   - These techniques were first developed in the physics community
     and so come with a strange language
   - In the /variational approximations/ we consider the *variational free
     energy*
     $$ \Phi(\bm{w}) = \int q(\bm{\theta}|\bm{w}) \,
     \logg{\frac{q(\bm{\theta}|\bm{w})}{f(\bm{\theta},\mathcal{D})}}
     \dd \bm{\theta} $$
     + writing $f(\bm{\theta},\mathcal{D}) =
       f(\bm{\theta}|\mathcal{D})\, f(\mathcal{D})$ we can rearrange the
       variational free energy as
       \begin{align*}
        \Phi(\bm{w}) &= \int q(\bm{\theta}|\bm{w}) \, \left(
        \logg{\frac{q(\bm{\theta}|\bm{w})}{f(\bm{\theta}|\mathcal{D})}} -
        \logg{f(\mathcal{D})} \right) \, \dd \bm{\theta} \\
        &= \mathrm{KL}\!\left(q(\bm{\theta}|\bm{w}) \big\|
        f(\bm{\theta}|\mathcal{D})\right)  - \logg{f(\mathcal{D})} 
        \end{align*}
     + where $\mathrm{KL}\!\left(q(\bm{\theta}|\bm{w}) \big\|
        f(\bm{\theta}|\mathcal{D})\right)$ is the KL divergence that
        measures the "distance" between $q(\bm{\theta}|\bm{w})$ and
       $f(\bm{\theta}|\mathcal{D})$
     + we have previously shown that the KL-divergence is
       non-negative and equal to zero if the two distributions are
       the same
     + The term $\logg{f(\mathcal{D})}$ is the /marginal likelihood/
       or /evidence/ and does not depend on the parameters $\bm{w}$
     + If we choose $\bm{\theta}$ to minimise $\Phi(\bm{w})$ then we
       minimise the KL-divergence and force $q(\bm{\theta}|\bm{w})$
       to approximate the posterior $f(\bm{\theta}|\mathcal{D})$
     + The variational free energy can also be written as
       \begin{align*}
        \Phi(\bm{w}) &= -\int q(\bm{\theta}|\bm{w}) \,
        \logg{f(\bm{\theta},\mathcal{D})}   \dd \bm{\theta} +
        \int q(\bm{\theta}|\bm{w}) \,\logg{q(\bm{\theta}|\bm{w})}
        \dd \bm{\theta} \\
        &= - \left( \strut L_{q}(\bm{w}) + H_{q}(\bm{w}) \right)
       \end{align*}
     + Minimising the variational free energy is equivalent to
       maximising $L_{q}(\bm{w}) + H_{q}(\bm{w})$
     + $L_{q}(\bm{w}) = \int q(\bm{\theta}|\bm{w}) \,
        \logg{f(\bm{\theta},\mathcal{D})}   \dd \bm{\theta}$
	is the expected log-likelihood of the data, where we have
       marginalised with respect to our approximate posterior
       $q(\bm{\theta}|\bm{w})$
     + $H_{q}(\bm{w}) = - \int q(\bm{\theta}|\bm{w})
       \,\logg{q(\bm{\theta}|\bm{w})} \dd \bm{\theta}$ is the entropy
       of our approximate posterior (this measure the uncertainty in
       $\bm{\theta}$)
     + We thus balance maximising the likelihood of the data with
       maximising the uncertainty in our approximate posterior
     + This means we fit the data, but guard against over fitting by
       allowing there to be a non-zero probability wherever it does
       not strongly contradict the data
     + In practice both $L_{q}(\bm{w})$ and $H_{q}(\bm{w})$ tend to be
       quite easy to compute
     + We are left with an optimisation problem for the parameters,
       $\bm{w}$, but this is usually quite quick to compute

* Exercise

** Mysterious Disease
   - Recall in the lecture on probabilistic inference, we defined $Z(t)$
     to be the number of people that catch a disease on day $t$
   - We assumed the growth rate is given by
     $$ \Prob{Z(t+1)} = \mathrm{Poi}\!\left(Z(t+1)\middle|
     \frac{r_0}{3}\, (Z(t)+Z(t-1)+Z(t-2)) \right) $$
     + that is people of contagious for three days
   - The observed number of new people with the disease, $X(t)$, on
     day $t$ is 
     $$ \Prob{X(t) = k} = \mathrm{Binom}(k|Z(t), p) = \binom{Z(t)}{k}
     p^k\,(1-p)^{Z(t)-k} $$
   - Here is $X(t)$ for the first 30 days\\
     0,0,0,0,1,1,2,1,0,0,3,10,19,34,44,93,117,221,376,633,\\
     1021,1643,2701,4503,7414,12091,19999,33286,54612,90283\\
   - Estimate $p$ and $r_{0}$ from the data
   - (If you prefer simulate your own data and estimate your parameters)

* Answers

** Mysterious Disease 
   - We need to decide on a prior
     + A reasonable prior for $p$ is a Beta distribution perhaps with
       $a=b=1$ (this is a uniform prior)
     + For $r_{0}$ we could use a Gamma prior with $a=2$ and $b=1$,
       this has a mean of $r_{0} =2$ (it seems to be considerably
       greater than 1)---we need to include $r_{0}^{19}\e{-20\,r_{0}}}$ as our
       prior (the normalisation is irrelevant)
   - Now we have to choose proposal distributions for the new values
      of $p$ and $r_{0}$
     + You could use $p' = p + U(-0.01,0.01)$ and $r_{0}' = r_{0} +
       U(-0.1,0.1)$ where $U(a,b)$ is a uniform random deviate
       between $a$ and $b$
     + This could have a problem in that $p$ and $r_{0}$ could take
       illegal values (i.e. we should have $0\leq r \leq 1$ and
       $r_{0} \geq0$), but for my data this is unlikely to happen
     + We could choose $p' \sim \mathrm{Beta}(10\,p, 10-10\,p)$ and
       $r_{0}' \sim r_{0}\,\mathrm{Gamma}(5,5) =
       \mathrm{Gamma}(5,5.r_{0})$, this ensures that in expectation
       $p'$ equals $p$ and $r_{0}'$ equals $r_{0}$ with small
       variations
       * Beware that there are two common definitions of Gamma
         distributions
	 \begin{align*}
	 \mathrm{Gamma}(z|,a,b) &= \frac{b^{a}}{\Gamma(a)}\,
         z^{a-1}\,\e{-b\,z} \\
	 \mathrm{Gamma}^{*}(z|,\alpha,\beta) &= 
         \frac{1}{\beta^{\alpha}\,\Gamma(\alpha)}
         z^{\alpha-1}\,\e{-z/\beta}
         \end{align*}
       * You have to check which of these your libraries use
       * In this case we would have Metropolis-Hastings to ensure we get
	 unbiased samples
   - The variables $Z(t)$ are latent variables (they will vary for
     each iteration) we can ignore them, but we could also estimate
     their mean as they tell us the actual number of cases of people with
     the virus
     - My data was generated with $p=0.1$ and $r_{0}=2.5$

* COMMENT [[file:pdf/mcmc.pdf][PDF]] [[file:pdf/mcmc_prn.pdf][Print]]
* COMMENT [[file:graphicalModels-subsidiary.org][Previous]] [[file:entropy-subsidiary.org][Next]]
* Options                                                  :ARCHIVE:noexport:
#+BEGIN_OPTIONS
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage[a4paper,margin=20mm]{geometry}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{amsfonts}
#+LATEX_HEADER: \usepackage{stmaryrd}
#+LATEX_HEADER: \usepackage{bm}
#+LaTeX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usemintedstyle{emacs}
#+LaTeX_HEADER: \usepackage[T1]{fontenc}
#+LaTeX_HEADER: \usepackage[scaled]{beraserif}
#+LaTeX_HEADER: \usepackage[scaled]{berasans}
#+LaTeX_HEADER: \usepackage[scaled]{beramono}
#+LATEX_HEADER: \newcommand{\tr}{\textsf{T}}
#+LATEX_HEADER: \newcommand{\grad}{\bm{\nabla}}
#+LATEX_HEADER: \newcommand{\av}[2][]{\mathbb{E}_{#1\!}\left[ #2 \right]}
#+LATEX_HEADER: \newcommand{\Prob}[2][]{\mathbb{P}_{#1\!}\left[ #2 \right]}
#+LATEX_HEADER: \newcommand{\logg}[1]{\log\!\left( #1 \right)}
#+LATEX_HEADER: \newcommand{\pred}[1]{\left\llbracket { \small #1} \right\rrbracket}
#+LATEX_HEADER: \newcommand{\e}[1]{{\rm e}^{#1}}
#+LATEX_HEADER: \newcommand{\dd}{\mathrm{d}}
#+LATEX_HEADER: \DeclareMathAlphabet{\mat}{OT1}{cmss}{bx}{n}
#+LATEX_HEADER: \newcommand{\normal}[2]{\mathcal{N}\!\left(#1 \big| #2 \right)}
#+LATEX_HEADER: \newcounter{eqCounter}
#+LATEX_HEADER: \setcounter{eqCounter}{0}
#+LATEX_HEADER: \newcommand{\explanation}{\setcounter{eqCounter}{0}\renewcommand{\labelenumi}{(\arabic{enumi})}}
#+LATEX_HEADER: \newcommand{\eq}[1][=]{\stepcounter{eqCounter}\stackrel{\text{\tiny(\arabic{eqCounter})}}{#1}}
#+LATEX_HEADER: \newcommand{\argmax}{\mathop{\mathrm{argmax}}}
#+LATEX_HEADER: \newcommand{\Dist}[2][Binom]{\mathrm{#1}\left( \strut {#2} \right)}
#+END_OPTIONS

