src/figures/mcmc-subsidiary.tex

\subsection{Variational Techniques}
\label{sec:orgd3ac26a}
\begin{itemize}
\item This is a completely different approach to MCMC, but it tries to
solve the same problem, but uses a different strategy
\item This is again technically challenging and I don't expect you to
memorise the derivation
\item We saw in earlier lectures that we can cheat by seeking the parameters that maximise
the posterior (the, so called, MAP solution)
\item But this sacrifices all the probabilistic information
\item In variational techniques we try to approximate the posterior
with a simpler distribution
\item That is, we approximate the prior \(f(\bm{\theta}|\mathcal{D})\)
with a simpler distribution \(q(\bm{\theta}|\bm{w})\) where we get
choose \(\bm{w}\) to make \(q\) close to \(f\)
\item Usually we choose \(q\) to be a factorisable distribution
$$ q(\bm{\theta}|\bm{w}) = \prod_{i} q(\theta_{i}|w_{i}) $$
\item These techniques were first developed in the physics community
and so come with a strange language
\item In the \emph{variational approximations} we consider the \textbf{variational free
energy}
$$ \Phi(\bm{w}) = \int q(\bm{\theta}|\bm{w}) \,
     \logg{\frac{q(\bm{\theta}|\bm{w})}{f(\bm{\theta},\mathcal{D})}}
     \dd \bm{\theta} $$
\begin{itemize}
\item writing \(f(\bm{\theta},\mathcal{D}) =
       f(\bm{\theta}|\mathcal{D})\, f(\mathcal{D})\) we can rearrange the
variational free energy as
\begin{align*}
 \Phi(\bm{w}) &= \int q(\bm{\theta}|\bm{w}) \, \left(
 \logg{\frac{q(\bm{\theta}|\bm{w})}{f(\bm{\theta}|\mathcal{D})}} -
 \logg{f(\mathcal{D})} \right) \, \dd \bm{\theta} \\
 &= \mathrm{KL}\!\left(q(\bm{\theta}|\bm{w}) \big\|
 f(\bm{\theta}|\mathcal{D})\right)  - \logg{f(\mathcal{D})} 
 \end{align*}
\item where \(\mathrm{KL}\!\left(q(\bm{\theta}|\bm{w}) \big\|
        f(\bm{\theta}|\mathcal{D})\right)\) is the KL divergence that
 measures the "distance" between \(q(\bm{\theta}|\bm{w})\) and
\(f(\bm{\theta}|\mathcal{D})\)
\item we have previously shown that the KL-divergence is
non-negative and equal to zero if the two distributions are
the same
\item The term \(\logg{f(\mathcal{D})}\) is the \emph{marginal likelihood}
or \emph{evidence} and does not depend on the parameters \(\bm{w}\)
\item If we choose \(\bm{\theta}\) to minimise \(\Phi(\bm{w})\) then we
minimise the KL-divergence and force \(q(\bm{\theta}|\bm{w})\)
to approximate the posterior \(f(\bm{\theta}|\mathcal{D})\)
\item The variational free energy can also be written as
\begin{align*}
 \Phi(\bm{w}) &= -\int q(\bm{\theta}|\bm{w}) \,
 \logg{f(\bm{\theta},\mathcal{D})}   \dd \bm{\theta} +
 \int q(\bm{\theta}|\bm{w}) \,\logg{q(\bm{\theta}|\bm{w})}
 \dd \bm{\theta} \\
 &= - \left( \strut L_{q}(\bm{w}) + H_{q}(\bm{w}) \right)
\end{align*}
\item Minimising the variational free energy is equivalent to
maximising \(L_{q}(\bm{w}) + H_{q}(\bm{w})\)
\item \(L_{q}(\bm{w}) = \int q(\bm{\theta}|\bm{w}) \,
        \logg{f(\bm{\theta},\mathcal{D})}   \dd \bm{\theta}\)
 is the expected log-likelihood of the data, where we have
marginalised with respect to our approximate posterior
\(q(\bm{\theta}|\bm{w})\)
\item \(H_{q}(\bm{w}) = - \int q(\bm{\theta}|\bm{w})
       \,\logg{q(\bm{\theta}|\bm{w})} \dd \bm{\theta}\) is the entropy
of our approximate posterior (this measure the uncertainty in
\(\bm{\theta}\))
\item We thus balance maximising the likelihood of the data with
maximising the uncertainty in our approximate posterior
\item This means we fit the data, but guard against over fitting by
allowing there to be a non-zero probability wherever it does
not strongly contradict the data
\item In practice both \(L_{q}(\bm{w})\) and \(H_{q}(\bm{w})\) tend to be
quite easy to compute
\item We are left with an optimisation problem for the parameters,
\(\bm{w}\), but this is usually quite quick to compute
\end{itemize}
\end{itemize}

\section{Exercise}
\label{sec:org5b04c10}

\subsection{Mysterious Disease}
\label{sec:orgc9f4a4c}
\begin{itemize}
\item Recall in the lecture on probabilistic inference, we defined \(Z(t)\)
to be the number of people that catch a disease on day \(t\)
\item We assumed the growth rate is given by
$$ \Prob{Z(t+1)} = \mathrm{Poi}\!\left(Z(t+1)\middle|
     \frac{r_0}{3}\, (Z(t)+Z(t-1)+Z(t-2)) \right) $$
\begin{itemize}
\item that is people of contagious for three days
\end{itemize}
\item The observed number of new people with the disease, \(X(t)\), on
day \(t\) is 
$$ \Prob{X(t) = k} = \mathrm{Binom}(k|Z(t), p) = \binom{Z(t)}{k}
     p^k\,(1-p)^{Z(t)-k} $$
\item Here is \(X(t)\) for the first 30 days\\
0,0,0,0,1,1,2,1,0,0,3,10,19,34,44,93,117,221,376,633,\\
1021,1643,2701,4503,7414,12091,19999,33286,54612,90283\\
\item Estimate \(p\) and \(r_{0}\) from the data
\item (If you prefer simulate your own data and estimate your parameters)
\end{itemize}

\section{Answers}
\label{sec:org884fc13}

\subsection{Mysterious Disease}
\label{sec:org53da1fa}
\begin{itemize}
\item We need to decide on a prior
\begin{itemize}
\item A reasonable prior for \(p\) is a Beta distribution perhaps with
\(a=b=1\) (this is a uniform prior)
\item For \(r_{0}\) we could use a Gamma prior with \(a=2\) and \(b=1\),
this has a mean of \(r_{0} =2\) (it seems to be considerably
greater than 1)---we need to include \(r_{0}^{19}\e{-20\,r_{0}}}\) as our
prior (the normalisation is irrelevant)
\end{itemize}
\item Now we have to choose proposal distributions for the new values
of \(p\) and \(r_{0}\)
\begin{itemize}
\item You could use \(p' = p + U(-0.01,0.01)\) and \(r_{0}' = r_{0} +
       U(-0.1,0.1)\) where \(U(a,b)\) is a uniform random deviate
between \(a\) and \(b\)
\item This could have a problem in that \(p\) and \(r_{0}\) could take
illegal values (i.e. we should have \(0\leq r \leq 1\) and
\(r_{0} \geq0\)), but for my data this is unlikely to happen
\item We could choose \(p' \sim \mathrm{Beta}(10\,p, 10-10\,p)\) and
\(r_{0}' \sim r_{0}\,\mathrm{Gamma}(5,5) =
       \mathrm{Gamma}(5,5.r_{0})\), this ensures that in expectation
\(p'\) equals \(p\) and \(r_{0}'\) equals \(r_{0}\) with small
variations
\begin{itemize}
\item Beware that there are two common definitions of Gamma
distributions
\begin{align*}
\mathrm{Gamma}(z|,a,b) &= \frac{b^{a}}{\Gamma(a)}\,
z^{a-1}\,\e{-b\,z} \\
\mathrm{Gamma}^{*}(z|,\alpha,\beta) &= 
\frac{1}{\beta^{\alpha}\,\Gamma(\alpha)}
z^{\alpha-1}\,\e{-z/\beta}
\end{align*}
\item You have to check which of these your libraries use
\item In this case we would have Metropolis-Hastings to ensure we get
unbiased samples
\end{itemize}
\end{itemize}
\item The variables \(Z(t)\) are latent variables (they will vary for
each iteration) we can ignore them, but we could also estimate
their mean as they tell us the actual number of cases of people with
the virus
\begin{itemize}
\item My data was generated with \(p=0.1\) and \(r_{0}=2.5\)
\end{itemize}
\end{itemize}
\end{document}
